Repository: vamsikrishnakukati/kubernetes-Dashboard
Catalog: dashboard-master/i18n/*/messages.*.xlf
Languages: fr

source: Target portal
fr: Portail cible

source: Server
fr: Serveur

source: Keyring
fr: Porte-clés

source: Monitors
fr: Moniteurs

source: Secret reference name
fr: Nom du secret référencé

source: User
fr: Utilisateur

source: Parameter
fr: Paramètre

source: Data
fr: Données

source: There is no data to display.
fr: Il n'y a pas de données à afficher.

source: Session Affinity
fr: Affinité de session

source: Selector
fr: Sélecteur

source: Old Replica Sets
fr: Anciens Replica Sets

source: Schedule:
fr: Planning:

source: Active Jobs:
fr: Jobs actifs :

source: Suspend:
fr: Suspendu :

source: Active Jobs
fr: Jobs actifs

source: Last schedule
fr: Dernière exécution

source: Concurrency policy
fr: Politique de concurrence

source: Inactive Jobs
fr: Jobs inactifs

source: Init images
fr: Images d'Init

source: Strategy:
fr: Stratégie :

source: Min ready seconds:
fr: Secondes minimales prêt :

source: Revision history limit:
fr: Limite d'historiques de révision :

source: Strategy
fr: Stratégie

source: Min ready seconds
fr: Secondes minimales prêt

source: Revision history limit
fr: Limite d'historiques de révision

source: Rolling update strategy
fr: Stratégie de Rolling update

source: Max surge:
fr: Augmentation max :

source: Max unavailable:
fr: Non disponibles max :

source: Max surge
fr: Augmentation max

source: Max unavailable
fr: Non disponibles max

source: Updated:
fr: Mis à jour :

source: Available:
fr: Disponibles :

source: Unavailable:
fr: Non disponibles :

source: Updated
fr: Mis à jour

source: Available
fr: Disponibles

source: Unavailable
fr: Non disponibles

source: New Replica Set
fr: Nouveau Replica Set

source: Completions:
fr: Achevés :

source: Parallelism:
fr: Parallélisme :

source: Completions
fr: Achevés

source: Parallelism
fr: Parallélisme

source: Status:
fr: Statut :

source: QoS Class
fr: Classe QoS

source: Init containers
fr: Conteneurs d'Init

source: Label Selector
fr: Sélecteur d'étiquettes

source: Settings have changed since last reload
fr: Les paramètres ont été modifiés depuis le dernier chargement

source: Do you want to save them anyways?
fr: Voulez-vous tout de même les sauvegarder ?

source: Refresh
fr: Actualiser

source: Global settings
fr: Paramètres généraux

source: Global settings are stored in config map, so all of them are applied for every instance of the app.
fr: Les paramètres généraux sont enregistrés dans une config map, ils sont donc utilisés pour toutes les instances de l'application.

source: Cluster name
fr: Nom du cluster

source: Cluster name appears in the browser window title if it is set.
fr: Le nom du cluster apparaît dans la barre de titre du navigateur s'il est défini.

source: Items per page
fr: Éléments par page

source: Logs auto-refresh time interval
fr: Intervalle d'actualisation automatique des journaux

source: Number of seconds between every auto-refresh of logs.
fr: Nombre de secondes entre chaque actualisation automatique des journaux.

source: Resource auto-refresh time interval
fr: Intervalle d'actualisation automatique des ressources

source: Number of seconds between every auto-refresh of every resource. Set 0 to disable.
fr: Nombre de secondes entre chaque actualisation automatique de chaque ressource. Mettre à 0 pour désactiver.

source: Disable access denied notification
fr: Désactiver les notifications d'accès interdit

source: Hides all access denied warnings in the notification panel.
fr: Cache tous les avertissements d'accès interdit dans le panneau de notifications.

source: Save
fr: Enregistrer

source: Reload
fr: Recharger

source: Local settings
fr: Paramètres locaux

source: Local settings are stored in the browser cookies, so they are not synchronized between multiple devices. Changes are applied automatically on every change.
fr: Les paramètres locaux sont stockés dans les cookies du navigateur, et ne sont ainsi pas synchronisés entre plusieurs appareils. Les changements sont appliqués automatiquement à chaque changement.

source: Dark theme
fr: Thème sombre

source: Use dark theme in the whole app
fr: Utiliser le thème sombre dans la totalité de l'application
