Repository: vamsikrishnakukati/kubernetes-Dashboard
Catalog: dashboard-master/i18n/*/messages.*.xlf
Languages: fr

source: Edit a resource
fr: Éditer une ressource

source: This action is equivalent to:
fr: Cette action est équivalente à :

source: Update
fr: Mettre à jour

source: Cancel
fr: Annuler

source: Delete a resource
fr: Supprimer une ressource

source: <span>Are you sure you want to delete {{data.displayName}} <i>{{data.objectMeta.name}}</i></span> <span> in namespace <i>{{data.objectMeta.namespace}}</i> </span> <span>?</span>
fr: <span>Êtes-vous sûr de vouloir supprimer <i>{{data.objectMeta.name}}</i> de genre {{data.displayName}}</span> <span> de l'espace de nom <i>{{data.objectMeta.namespace}}</i> </span> <span>&nbsp;?</span>

source: Delete
fr: Supprimer

source: Download logs file
fr: Téléchargement des journaux

source: Size: {{loaded | kdMemory}} B
fr: Taille : {{loaded | kdMemory}} o

source: Preparing file to download...
fr: Préparation du fichier à télécharger...

source: File is ready to download!
fr: Le fichier est prêt à être téléchargé !

source: Forbidden (403)
fr: Interdit (403)

source: You do not have required permissions to access this resource.
fr: Vous n'avez pas les permissions nécessaires pour accéder à cette ressource.

source: Save
fr: Enregistrer

source: Abort
fr: Annuler

source: Close
fr: Fermer

source: Scale a resource
fr: Mettre à l'échelle une ressource

source: {{data.displayName}} {{data.objectMeta.name}} will be updated to reflect the desired replicas count.
fr: {{data.displayName}} {{data.objectMeta.name}} sera mis à jour pour refléter le nombre de répliques demandéss.

source: Desired replicas
fr: Répliques désirées

source: Actual replicas
fr: Répliques actuelles

source: Scale
fr: Mettre à l'échelle

source: Cancel
fr: Annuler

source: Trigger a {{data.displayName}}
fr: Déclencher un {{data.displayName}}

source: {{data.displayName}} {{data.objectMeta.name}} will be triggered.
fr: {{data.displayName}} {{data.objectMeta.name}} sera déclenché.

source: Trigger
fr: Déclencher

source: Workload Status
fr: Statut des charges de travail

source: Deployments
fr: Déploiements

source: Age
fr: Âge

source: Replication Controllers
fr: Contrôleurs de réplication

source: Resource information
fr: Informations sur la ressource

source: Workloads
fr: Charges de travail

source: Config and Storage
fr: Configuration et Stockage

source: Create new resource
fr: Créer une nouvelle ressource

source: Metadata
fr: Métadonnées

source: Name:
fr: Nom :

source: Namespace:
fr: Espace de nom :

source: Age:
fr: Âge :

source: Name
fr: Nom

source: Namespace
fr: Espace de nom

source: Age
fr: Âge

source: Labels
fr: Étiquettes

source: Show less
fr: Voir moins

source: Show all
fr: Voir plus

source: Filter
fr: Filtrer

source: Filter objects by name
fr: Filtrer les objets par nom

source: Logs from
fr: Journaux de

source: Containers
fr: Conteneurs

source: Init Containers
fr: Conteneurs d'initilisation

source: in
fr: dans

source: Download logs
fr: Télécharger les journaux

source: Logs from <kd-date></kd-date> to <kd-date></kd-date> UTC
fr: Logs de <kd-date></kd-date> à <kd-date></kd-date> UTC

source: Invert colors
fr: Inverser les couleurs

source: Reduce font size
fr: Réduire les caractères

source: Show timestamps
fr: Voir les horodatages

source: Follow logs
fr: Suivre les journaux

source: Show previous logs
fr: Voir les journaux précédents

source: Go to namespace overview
fr: Aller à l'aperçu de l'espace de nom

source: Logs
fr: Journaux

source: Exec
fr: Exécuter

source: Trigger
fr: Déclencher

source: Scale
fr: Mettre à l'échelle

source: Unpin
fr: Détacher

source: Pin
fr: Épingler

source: Edit
fr: Éditer

source: There is nothing to display here
fr: Il n'y a rien à afficher ici

source: You can <a>deploy a containerized app</a>, select other namespace or <a>take the Dashboard Tour <mat-icon>open_in_new</mat-icon></a> to learn more.
fr: Vous pouvez <a>déployer une application conteneurisée</a>, sélectionner un autre espace de nom ou <a>suivre le Dashboard Tour <mat-icon>open_in_new</mat-icon></a> pour en savoir plus.

source: Resource Quotas
fr: Quotas de ressources

source: Status
fr: Statut

source: Restarts
fr: Redémarrages

source: Resource Limits
fr: Limites de ressources

source: Resource name
fr: Nom de la ressource

source: Resource type
fr: Type de la ressource

source: Default
fr: Défaut

source: Default request
fr: Requête par défaut

source: Endpoints
fr: Terminaisons

source: Cluster IP
fr: IP cluster

source: Internal Endpoints
fr: Terminaisons internes

source: External Endpoints
fr: Terminaisons externes

source: Items:
fr: Éléments :

source: Host
fr: Hôte

source: Ports (Name, Port, Protocol)
fr: Ports (Nom, Port, Protocole)

source: unset
fr: non défini

source: Events
fr: Événements

source: Node
fr: Noeud

source: Ready
fr: Prêt

source: Sub-object
fr: Sous-objet

source: Count
fr: Compte

source: First Seen
fr: Première vue

source: Last Seen
fr: Dernière vue

source: Min Replicas
fr: Min réplicas

source: Max Replicas
fr: Max réplicas

source: Reference
fr: Référence

source: Environment variable
fr: Variable d'environnement

source: {{formatSecretValue(env.value).length}} bytes
fr: {{formatSecretValue(env.value).length}} octets

source: Commands
fr: Commandes

source: Persistent Volume Claims
fr: Demandes de volume persistant

source: Last probe time
fr: Dernière sonde

source: Last transition time
fr: Dernière transition

source: Reason
fr: Motif

source: Storage Classes
fr: Classes de stockage

source: Provisioner
fr: Approvisionneur

source: Parameters
fr: Paramètres

source: Schedule
fr: Planning

source: Suspend
fr: Suspendu

source: Active
fr: Actif

source: Last Schedule
fr: Dernière exécution

source: Created
fr: Date de création

source: Plugins
fr: Extensions

source: Dependencies
fr: Dépendances

source: Kind:
fr: Genre :

source: Controlled by
fr: Contrôlé par

source: Kind
fr: Genre

source: CPU requests (cores)
fr: Requêtes CPU (coeurs)

source: CPU limits (cores)
fr: Limites CPU (coeurs)

source: Memory requests (bytes)
fr: Requêtes mémoire (octets)

source: Memory limits (bytes)
fr: Limites mémoire (octets)

source: Custom Resource Definitions
fr: Définitions de ressources personnalisées

source: Group
fr: Groupe

source: Full Name
fr: Nom complet

source: Namespaced
fr: Relatif à un espace de nom

source: Objects
fr: Objets

source: Served
fr: Servie

source: Storage
fr: Stockage

source: Namespaces
fr: Espaces de noms

source: Persistent Volumes
fr: Volumes persistants

source: Capacity
fr: Capacité

source: Access Modes
fr: Modes d'accès

source: Reclaim Policy
fr: Politique de recyclage

source: Claim
fr: Demande

source: Storage Class
fr: Classe de stockage

source: Pods status
fr: Statut des pods

source: Running:
fr: En fonctionnement :

source: Succeeded:
fr: Réussis :

source: Pending:
fr: En attente :

source: Failed:
fr: Échoués :

source: Desired:
fr: Désirés :

source: Running
fr: En fonctionnement

source: Succeeded
fr: Réussis

source: Pending
fr: En attente

source: Failed
fr: Échoués

source: Desired
fr: Désirés

source: CPU Usage (cores)
fr: Utilisation CPU (coeurs)

source: Memory Usage (bytes)
fr: Utilisation mémoire (octets)

source: Namespace conflict
fr: Conflit d'espace de nom

source: Selected namespace is different than namespace of currently selected resource.
fr: L'espace de nom sélectionné ne correspond pas à l'espace de nom de la ressource actuellement sélectionnée.

source: Do you want to stay on current page and change namespace from <i>{{namespace}}</i> to <i>{{newNamespace}}</i>?
fr: Désirez-vous rester sur la page en cours et modifier l'espace de nom de <i>{{namespace}}</i> à <i>{{newNamespace}}</i> ?

source: Yes
fr: Oui

source: No
fr: Non

source: Select namespace...
fr: Sélectionnez un espace...

source: All namespaces
fr: Tous les espaces de noms

source: NAMESPACES
fr: ESPACES DE NOMS

source: Rules
fr: Règles

source: Resources
fr: Ressources

source: Non-resource URL
fr: URL non-ressource

source: Resource Names
fr: Noms de ressource

source: Verbs
fr: Verbes

source: API Groups
fr: Groupes d'API

source: Delete resource
fr: Supprimer la ressource

source: Edit resource
fr: Éditer la ressource

source: Scale resource
fr: Mettre à l'échelle la ressource

source: View logs
fr: Voir les journaux

source: Exec into pod
fr: Exécuter dans le pod

source: Trigger resource
fr: Déclencher la ressource

source: No resources found.
fr: Aucune ressource trouvée.

source: Read documentation
fr: Lire la documentation

source: Provide feedback
fr: Faire un commentaire

source: Resource Information
fr: Informations sur la ressource

source: Scope
fr: Portée

source: Subresources
fr: Sous-ressources

source: Accepted Names
fr: Noms acceptés

source: Plural
fr: Pluriel

source: Singular
fr: Singulier

source: List Kind
fr: Type de liste

source: Short Names
fr: Noms abrégés

source: Categories
fr: Catégories

source: About
fr: À propos

source: General-purpose web UI for Kubernetes clusters
fr: Inferface utilisateur web générique pour clusters Kubernetes

source: Kubernetes Dashboard is made possible by the Dashboard <a>community</a> as an <a>open source project</a>.
fr: Kubernetes Dashboard est rendu possible par la <a>communauté</a> Dashboard comme un <a>projet open source</a>.

source: Nodes
fr: Noeuds

source: Search
fr: Recherche

source: <kd-date></kd-date> ago
fr: il y a <kd-date></kd-date>

source: There are no notifications
fr: Aucune notification

source: Remove all notifications
fr: Supprimer toutes les notifications

source: Logged in with auth header
fr: Connecté avec une entête auth

source: Logged in with token
fr: Connecté avec un token

source: Default service account
fr: Compte de service par défaut

source: Sign in
fr: Connexion

source: Sign out
fr: Déconnexion

source: Token
fr: Jeton

source: Please select the kubeconfig file that you have created to configure access to the cluster. To find out more about how to configure and use kubeconfig file, please refer to the <a>Configure Access to Multiple Clusters</a> section.
fr: Veuillez sélectionner le fichier kubeconfig que vous avez créé pour accéder au cluster. Pour en savoir plus sur la façon de configurer et utiliser un fichier kubeconfig, veuillez vous référer à la section <a>Configurer l'accès à plusieurs clusters</a>.

source: Make sure that support for basic authentication is enabled in the cluster. To find out more about how to configure basic authentication, please refer to the <a>Authenticating</a> and <a>ABAC Mode</a> sections.
fr: Assurez-vous que le support pour l'authentification Basic est activéde pour le cluster. Pour en savoir plus sur la façon de configurer l'authentification Basic, veuillez vous référer aux sections <a>S'authentifier</a> et <a>Mode ABAC</a>.

source: Every Service Account has a Secret with valid Bearer Token that can be used to log in to Dashboard. To find out more about how to configure and use Bearer Tokens, please refer to the <a>Authentication</a> section.
fr: Chaque compte de service a un Secret associé avec un jeton porteur (Bearer Token) valide qui peut être utilisé pour se connecter au Dashboard. Pour en savoir plus sur la façon de configurer et utiliser des jetons porteurs, veuillez vous référer à la section <a>Authentification</a>.

source: Enter token
fr: Saisissez un jeton

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: Choose kubeconfig file
fr: Sélectionnez un fichier kubeconfig

source: Sign in
fr: Connexion

source: Skip
fr: Passer

source: Create from input
fr: Créer en ligne

source: Create from file
fr: Créer depuis un fichier

source: Create from form
fr: Créer depuis un formulaire

source: Shell in <mat-select> <mat-option> {{ item }} </mat-option> </mat-select> in {{ podName }}
fr: Shell dans <mat-select> <mat-option> {{ item }} </mat-option> </mat-select> dans {{ podName }}

source: Create a new namespace
fr: Créer un nouvel espace de nom

source: The new namespace will be added to the cluster.
fr: Le nouvel espace de nom sera rajouté au cluster.

source: Namespace name
fr: Nom de l'espace de nom

source: Name is required.
fr: Le nom est requis.

source: Create a new image pull secret
fr: Créer un nouveau pull secret pour l'image

source: The new secret will be added to the cluster
fr: Le nouveau secret sera rajouté au cluster

source: Secret name
fr: Nom du secret

source: Name must be up to {{namespaceMaxLength}} characters long.
fr: Le nom ne doit pas dépasser {{namespaceMaxLength}} caractères.

source: Name must be alphanumeric and may contain dashes.
fr: Le nom doit être alphanumérique et peut contenir des tirets.

source: A namespace with the specified name will be added to the cluster.
fr: Un espace de nom ayant le nom spécifié sera ajouté au cluster.

source: Learn more <i>open_in_new</i>
fr: En savoir plus <i> open_in_new </i>

source: Create
fr: Créer

source: Name must be up to {{secretNameMaxLength}} characters long.
fr: Le nom ne doit pas dépasser {{secretNameMaxLength}} caractères.

source: Name must follow the DNS domain name syntax (e.g. new.image-pull.secret).
fr: Le nom doit suivre la syntaxe d'un nom de domaine DNS (par ex. new.image-pull.secret).

source: A secret with the specified name will be added to the cluster in the namespace.
fr: Un secret ayant le nom spécifié sera ajouté au cluster dans l'espace de nom.

source: Data is required.
fr: Les données sont requises.

source: Data must be Base64 encoded.
fr: Les données doivent être encodées en Base64.

source: Specify the data for your secret to hold. The value is the Base64 encoded content of a .dockercfg file.
fr: Spécifie les données que le secret va contenir. La valeur est le contenu encodé en Base64 du fichier .dockercfg.

source: App name
fr: Nom de l'application

source: Deployment or service with this name already exists within namespace.
fr: Un déploiement ou un service ayant ce nom existe déjà dans l'espace de nom.

source: Application name is required.
fr: Le nom de l'application est requis.

source: Application name must start with a lowercase letter and contain only lowercase letters, numbers, and '-' between words.
fr: Le nom de l'application doit commencer avec une lettre minuscule et contenir uniquement des lettres minuscules, des nombres, et des '-' entre les mots.

source: An 'app' label with this value will be added to the Deployment and Service that get deployed.
fr: Une étiquette 'app' avec cette valeur sera ajoutée au déploiement et au service qui seront déployés.

source: Learn more <i>open_in_new</i>
fr: En savoir plus <i> open_in_new </i>

source: Container image
fr: Image du conteneur

source: Container image is required
fr: L'image du conteneur est requise

source: Container image is invalid: {{containerImage.errors?.validImageReference}}
fr: L'image du conteneur n'est pas valide : {{containerImage.errors?.validImageReference}}

source: Enter the URL of a public image on any registry, or a private image hosted on Docker Hub or Google Container Registry.
fr: Saisissez l'URL d'une image publique d'un quelconque registre ou une image privée hébergée dans Docker Hub ou Google Container Registry.

source: Number of pods
fr: Nombre de pods

source: Number of pods is required
fr: Le nombre de pods est requis

source: Number of pods must be a positive integer
fr: Le nombre de pods doit être un entier positif

source: Setting high number of pods may cause performance issues of the cluster and Dashboard UI.
fr: Définir un grand nombre de pods peut entaîner des problèmes de performance du cluster et de l'UI Dashboard.

source: A Deployment will be created to maintain the desired number of pods across your cluster.
fr: Un déploiement sera créé pour maintenir le nombre désiré de pods dans votre cluster.

source: Optionally, an internal or external Service can be defined to map an incoming Port to a target Port seen by the container.
fr: Éventuellement, un Service interne ou externe peut être défini pour mapper un port entrant à un port cible vu par le conteneur.

source: The description will be added as an annotation to the Deployment and displayed in the application's details.
fr: La description sera rajoutée comme annotation au déploiement et ajoutée dans les détails de l'application.

source: The specified labels will be applied to the created Deployment, Service (if any) and Pods. Common labels include release, environment, tier, partition and track.
fr: Les étiquettes spécifiées seront appliqués au Déploiement, au Service (le cas échéant) et aux Pods créés. Des étiquettes courantes sont release, environment, tier, partition et track.

source: Learn more <i>open_in_new</i>
fr: En savoir plus <i> open_in_new </i>

source: Create a new namespace...
fr: Créer un nouvel espace de nom...

source: Namespaces let you partition resources into logically named groups.
fr: Les espaces de noms vous permettent de distribuer vos ressources dans des groupes logiques nommés.

source: Create a new secret...
fr: Créer un nouveau secret...

source: Image Pull Secret
fr: Pull Secret pour l'image

source: The specified image could require a pull secret credential if it is private. You may choose an existing secret or create a new one.
fr: L'image spécifiée peut nécessiter un pull secret si elle est privée. Vous pouvez choisir un secret existant ou en créer un nouveau.

source: CPU requirement (cores)
fr: Exigence CPU (coeurs)

source: CPU requirement must be given as a positive number.
fr: L'exigence CPU doit être un nombre positif.

source: CPU requirement must be given as a valid number.
fr: L'exigence CPU doit être un nombre valide.

source: Memory requirement (MiB)
fr: Exigence mémoire (MiB)

source: Memory requirement must be given as a positive number.
fr: L'exigence mémoire doit être un nombre positif.

source: Memory requirement must be given as a valid number.
fr: L'exigence mémoire doit être un nombre valide.

source: You can specify minimum CPU and memory requirements for the container.
fr: Vous pouvez indiquer des exigences minimales pour le CPU et la mémoire pour le conteneur.

source: Run command
fr: Commande à exécuter

source: Run command arguments
fr: Arguments de la commande à exécuter

source: By default, your containers run the selected image's default entrypoint command. You can use the command options to override the default.
fr: Par défaut, vos conteneurs exécutent la commande entrypoint par défaut de l'image. Vous pouvez utiliser les options pour outrepasser le comportement par défaut.

source: Run as privileged
fr: Exécuter en mode privilégié

source: Processes in privileged containers are equivalent to processes running as root on the host.
fr: Les processus dans des conteneurs privilégiés sont équivalents à des processus s'exécutant en root sur l'hôte.

source: Environment variables available for use in the container. Values can reference other variables using $(VAR_NAME) syntax.
fr: Variables d'environnement disponibles dans le conteneur. Les valeurs peuvent référencer d'autres variables en utilisant la syntaxe $(NOM_VARIABLE).

source: Deploy
fr: Déployer

source: Cancel
fr: Annuler

source: {VAR_SELECT, select, 1 {Hide advanced options} other {Show advanced options} }
fr: {VAR_SELECT, select, 1 {Cacher les options avancées} other {Afficher les options avancées} }

source: Enter YAML or JSON content specifying the resources to create to the namespace specified in the file.
fr: Entrez un contenu YAML ou JSON spécifiant les ressources à créer dans l'espace de nom spécifié dans le contenu.

source: Enter YAML or JSON content specifying the resources to create to the currently selected namespace.
fr: Entrez un contenu YAML ou JSON spécifiant les ressources à créer dans l'espace de nom sélectionné.

source: Learn more <i>open_in_new</i>
fr: En savoir plus <i> open_in_new </i>

source: Upload
fr: Télécharger

source: Select YAML or JSON file specifying the resources to deploy to the namespace specified in the file.
fr: Sélectionnez un fichier YAML ou JSON spécifiant les ressources à déployer dans l'espace de nom spécifié dans le fichier.

source: Select YAML or JSON file specifying the resources to deploy to the currently selected namespace.
fr: Sélectionnez un fichier YAML ou JSON file spécifiant les ressources à déployer dans l'espace de nom sélectionné.

source: Learn more <i>open_in_new</i>
fr: En savoir plus <i> open_in_new </i>

source: Choose YAML or JSON file
fr: Sélectionnez un fichier YAML ou JSON

source: Upload
fr: Télécharger

source: Environment variables
fr: Variables d'environnement

source: Variable name must be a valid C identifier.
fr: Le nom de variable doit être un identifiant C valide.

source: Value
fr: Valeur

source: Port must be an integer.
fr: Le port doit être un entier.

source: Port cannot be empty.
fr: Le port ne peut pas être vide.

source: Port must be greater than 0.
fr: Le port doit être supérieur à 0.

source: Port must be less than 65536.
fr: Le port doit être inférieur à 65536.

source: Target port
fr: Port cible

source: Target port must be an integer.
fr: Le port cible doit être un entier.

source: Target port cannot be empty.
fr: Le port cible ne peut pas être vide.

source: Target port must be greater than 0.
fr: Le port cible doit être supérieur à 0.

source: Target port must be less than 65536.
fr: Le port cible doit être inférieur à 65536.

source: Protocol
fr: Protocole

source: Protocol is required.
fr: Le protocole est requis.

source: Invalid protocol.
fr: Protocole invalide.

source: key
fr: clé

source: {{label.get('key').value}} is not unique
fr: {{label.get('key').value}} n'est pas unique

source: Prefix is not a valid DNS subdomain prefix (eg. my-domain.com).
fr: Le préfixe n'est pas un préfixe de sous-domaine DNS valide (par ex. mon-domaine.com).

source: Label key name must be alphanumeric separated by '-', '_' or '.', optionally prefixed by a DNS subdomain and '/'.
fr: Le nom de la clé de l'étiquette doit être alphanumérique séparé par '-', '_' ou '.', optionnellement préfixé par un sous-domaine DNS et '/'.

source: Prefix should not exceed 253 characters.
fr: Le préfixe ne doit pas excéder 253 caractères.

source: Label Key name should not exceed 63 characters.
fr: Le nom de la clé de l'étiquette ne doit pas excéder 63 caractères.

source: value
fr: valeur

source: Label value must be alphanumeric separated by '.' , '-' or '_'.
fr: La valeur de l'étiquette doit être alphanumérique séparé par '.' , '-' ou '_'.

source: Label Value must not exceed 253 characters.
fr: La valeur de l'étiquette ne doit pas excéder 253 caractères.

source: Pod CIDR
fr: CIDR du pod

source: Provider ID
fr: ID du fournisseur

source: Unschedulable
fr: Non programmable

source: Addresses
fr: Adresses

source: Taints
fr: Marquages

source: System information
fr: Informations sur le système

source: Machine ID
fr: ID de la machine

source: System UUID
fr: UUID du système

source: Boot ID
fr: ID de boot

source: Kernel version
fr: Version du noyau

source: OS Image
fr: Image de l'OS

source: Container runtime version
fr: Version du runtime de conteneurs

source: kubelet version
fr: Version de kubelet

source: kube-proxy version
fr: Version de kube-proxy

source: Operating system
fr: Système d'exploitation

source: Memory
fr: Mémoire

source: Reclaim policy
fr: Politique de recyclage

source: Storage class
fr: Classe de stockage

source: Access modes
fr: Modes d'accès

source: Quantity
fr: Quantité

source: Filesystem type
fr: Type de système de fichiers

source: Read only
fr: Lecture seule

source: Volume ID
fr: ID du volume

source: Target World Wide Names
fr: Noms globaux (WWNs) de la cible

source: Dataset name
fr: Nom du jeu de données

source: Persistent disk name
fr: Nom du disque persistant

source: Path
fr: Chemin

source: iSCSI Qualified Name
fr: Nom qualifié iSCSI

source: iSCSI target lun number
fr: LUN du iSCSI cible
